
"Quarterly" = "Σχολή Σαββάτου σε ένα μέρος";

"Lesson" = "Εβδομαδιαία μαθήματα";

"Reading" = "Σπουδαστικό σχολείο Σαββάτου";

"Verse" = "Γραμματοστοιχεία στο χέρι";

"Theme" = "Προσαρμοσμένη εμπειρία ανάγνωσης";
